{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 200711], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}, "training_config": {"optimizer_config": {"class_name": "SGD", "config": {"lr": 0.009999999776482582, "momentum": 0.8999999761581421, "decay": 9.999999974752427e-07, "nesterov": true}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of50.bin", "group1-shard2of50.bin", "group1-shard3of50.bin", "group1-shard4of50.bin", "group1-shard5of50.bin", "group1-shard6of50.bin", "group1-shard7of50.bin", "group1-shard8of50.bin", "group1-shard9of50.bin", "group1-shard10of50.bin", "group1-shard11of50.bin", "group1-shard12of50.bin", "group1-shard13of50.bin", "group1-shard14of50.bin", "group1-shard15of50.bin", "group1-shard16of50.bin", "group1-shard17of50.bin", "group1-shard18of50.bin", "group1-shard19of50.bin", "group1-shard20of50.bin", "group1-shard21of50.bin", "group1-shard22of50.bin", "group1-shard23of50.bin", "group1-shard24of50.bin", "group1-shard25of50.bin", "group1-shard26of50.bin", "group1-shard27of50.bin", "group1-shard28of50.bin", "group1-shard29of50.bin", "group1-shard30of50.bin", "group1-shard31of50.bin", "group1-shard32of50.bin", "group1-shard33of50.bin", "group1-shard34of50.bin", "group1-shard35of50.bin", "group1-shard36of50.bin", "group1-shard37of50.bin", "group1-shard38of50.bin", "group1-shard39of50.bin", "group1-shard40of50.bin", "group1-shard41of50.bin", "group1-shard42of50.bin", "group1-shard43of50.bin", "group1-shard44of50.bin", "group1-shard45of50.bin", "group1-shard46of50.bin", "group1-shard47of50.bin", "group1-shard48of50.bin", "group1-shard49of50.bin", "group1-shard50of50.bin"], "weights": [{"name": "dense_1/kernel", "shape": [200711, 256], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [256, 256], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [256, 5], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [5], "dtype": "float32"}]}]}